ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U0xx/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2025 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32U0xx/hal_lld.h
 * @brief   STM32U0xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32U031xx.
 *          - STM32U073xx, STM32U083xx.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Requires use of SPIv2 driver model.
 */
#define HAL_LLD_SELECT_SPI_V2           TRUE

/**
 * @name    Platform identification
 * @{
 */
#if defined(STM32U031xx)
#define PLATFORM_NAME           "STM32U0 Ultra-low-power Access Line"

#elif defined(STM32U073xx)
#define PLATFORM_NAME           "STM32U0 Ultra-low-power with USB"

#elif defined(STM32U083xx)
#define PLATFORM_NAME           "STM32U0 Ultra-low-power with USB and LCD"

#else
#error "STM32U0 device not specified"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(STM32U0XX) || defined(__DOXYGEN__)
#define STM32U0XX
#endif
/** @} */

/**
 * @name   Clock points names
 * @{
 */
#define CLK_SYSCLK                          0U
#define CLK_HSI16CLK                        1U
#define CLK_HSI48CLK                        2U
#define CLK_HSECLK                          3U
#define CLK_LSICLK                          4U
#define CLK_LSECLK                          5U
#define CLK_MSICLK                          6U
#define CLK_PLLPCLK                         7U
#define CLK_PLLQCLK                         8U
#define CLK_PLLRCLK                         9U
#define CLK_HCLK                            10U
#define CLK_PCLK                            11U
#define CLK_PCLKTIM                         12U
#define CLK_MCO                             13U
#define CLK_MCO2                            14U
#define CLK_LSCO                            15U
#define CLK_ARRAY_SIZE                      16U
#define CLK_POINT_NAMES                                                     \
  {                                                                         \
    "SYSCLK", "HSI16", "HSI48", "HSE", "LSI", "LSE", "MSI", "PLLP", "PLLQ", \
    "PLLR", "HCLK", "PCLK", "PCLKTIM", "MCO", "MCO2", "LSCO"                \
  }
/** @} */

/**
 * @name    PWR_CR1 register helpers
 * @{
 */
#define PWR_CR1_LPMS_VALUE(n)               ((n) << PWR_CR1_LPMS_Pos)
#define PWR_CR1_LPMS_STOP0                  PWR_CR1_LPMS_VALUE(0)
#define PWR_CR1_LPMS_STOP1                  PWR_CR1_LPMS_VALUE(1)
#define PWR_CR1_LPMS_STOP2                  PWR_CR1_LPMS_VALUE(2)

#define PWR_CR1_VOS_VALUE(n)                ((n) << PWR_CR1_VOS_Pos)
#define PWR_CR1_VOS_RANGE1                  PWR_CR1_VOS_VALUE(1U)
#define PWR_CR1_VOS_RANGE2                  PWR_CR1_VOS_VALUE(2U)
/** @} */

/**
 * @name    PWR_CR2 register helpers
 * @{
 */
#define PWR_CR2_PLS_VALUE(n)                ((n) << PWR_CR2_PLS_Pos)
#define PWR_CR2_PLS_2P0V                    PWR_CR2_PLS_VALUE(0)
#define PWR_CR2_PLS_2P2V                    PWR_CR2_PLS_VALUE(1)
#define PWR_CR2_PLS_2P4V                    PWR_CR2_PLS_VALUE(2)
#define PWR_CR2_PLS_2P5V                    PWR_CR2_PLS_VALUE(3)
#define PWR_CR2_PLS_2P6V                    PWR_CR2_PLS_VALUE(4)
#define PWR_CR2_PLS_2P7V                    PWR_CR2_PLS_VALUE(5)
#define PWR_CR2_PLS_2P8V                    PWR_CR2_PLS_VALUE(6)
#define PWR_CR2_PLS_2P9V                    PWR_CR2_PLS_VALUE(7)
/** @} */

/**
 * @name    RCC_CR register helpers
 * @{
 */
#define RCC_CR_MSIRANGE_FIELD(n)            ((n) << RCC_CR_MSIRANGE_Pos)
#define RCC_CR_MSIRANGE_100kHz              RCC_CR_MSIRANGE_FIELD(0)
#define RCC_CR_MSIRANGE_200kHz              RCC_CR_MSIRANGE_FIELD(1)
#define RCC_CR_MSIRANGE_400kHz              RCC_CR_MSIRANGE_FIELD(2)
#define RCC_CR_MSIRANGE_800kHz              RCC_CR_MSIRANGE_FIELD(3)
#define RCC_CR_MSIRANGE_1MHz                RCC_CR_MSIRANGE_FIELD(4)
#define RCC_CR_MSIRANGE_2MHz                RCC_CR_MSIRANGE_FIELD(5)
#define RCC_CR_MSIRANGE_4MHz                RCC_CR_MSIRANGE_FIELD(6)
#define RCC_CR_MSIRANGE_8MHz                RCC_CR_MSIRANGE_FIELD(7)
#define RCC_CR_MSIRANGE_16MHz               RCC_CR_MSIRANGE_FIELD(8)
#define RCC_CR_MSIRANGE_24MHz               RCC_CR_MSIRANGE_FIELD(9)
#define RCC_CR_MSIRANGE_32MHz               RCC_CR_MSIRANGE_FIELD(10)
#define RCC_CR_MSIRANGE_48MHz               RCC_CR_MSIRANGE_FIELD(11)
/** @} */

/**
 * @name    RCC_CFGR register helpers
 * @{
 */
#define RCC_CFGR_SW_VALUE(n)                ((n) << RCC_CFGR_SW_Pos)
#define RCC_CFGR_SW_MSI                     RCC_CFGR_SW_VALUE(0U)
#define RCC_CFGR_SW_HSI16                   RCC_CFGR_SW_VALUE(1U)
#define RCC_CFGR_SW_HSE                     RCC_CFGR_SW_VALUE(2U)
#define RCC_CFGR_SW_PLLRCLK                 RCC_CFGR_SW_VALUE(3U)
#define RCC_CFGR_SW_LSI                     RCC_CFGR_SW_VALUE(4U)
#define RCC_CFGR_SW_LSE                     RCC_CFGR_SW_VALUE(5U)

