ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U0xx/hal_lld.h
/*
 * LSE related checks.
 */
#if STM32_LSE_ENABLED
#else /* !STM32_LSE_ENABLED */

  #if STM32_SW == RCC_CFGR_SW_LSI
    #error "LSI not enabled, required by STM32_SW"
  #endif

  #if STM32_RTCSEL == RCC_BDCR_RTCSEL_LSE
    #error "LSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_MCOSEL == RCC_CFGR_MCOSEL_LSE
    #error "LSE not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_MCO2SEL == RCC_CFGR_MCO2SEL_LSE
    #error "LSE not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_LSCOSEL == RCC_BDCR_LSCOSEL_LSE
    #error "LSE not enabled, required by STM32_LSCOSEL"
  #endif

  #if (STM32_USART1SEL == RCC_CCIPR_USART1SEL_LSE)
    #error "LSE not enabled, required by STM32_USART1SEL"
  #endif
  #if (STM32_USART2SEL == RCC_CCIPR_USART2SEL_LSE)
    #error "LSE not enabled, required by STM32_USART2SEL"
  #endif
  #if (STM32_LPUART1SEL == RCC_CCIPR_LPUART1SEL_LSE)
    #error "LSE not enabled, required by STM32_LPUART1SEL"
  #endif
  #if (STM32_LPUART2SEL == RCC_CCIPR_LPUART2SEL_LSE)
    #error "LSE not enabled, required by STM32_LPUART2SEL"
  #endif
  #if (STM32_LPUART3SEL == RCC_CCIPR_LPUART3SEL_LSE)
    #error "LSE not enabled, required by STM32_LPUART3SEL"
  #endif

  #if (STM32_LPTIM1SEL == RCC_CCIPR_LPTIM1SEL_LSE)
    #error "LSE not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if (STM32_LPTIM2SEL == RCC_CCIPR_LPTIM2SEL_LSE)
    #error "LSE not enabled, required by STM32_LPTIM2SEL"
  #endif
  #if (STM32_LPTIM3SEL == RCC_CCIPR_LPTIM3SEL_LSE)
    #error "LSE not enabled, required by STM32_LPTIM3SEL"
  #endif

#endif /* !STM32_LSE_ENABLED */

/**
 * @brief   PLL input clock frequency.
 */
#if (STM32_PLLSRC == RCC_PLLCFGR_PLLSRC_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_PLLCLKIN            0

#elif STM32_PLLSRC == RCC_PLLCFGR_PLLSRC_MSI
  #define STM32_PLLCLKIN            (STM32_MSICLK / STM32_PLLM_VALUE)

#elif STM32_PLLSRC == RCC_PLLCFGR_PLLSRC_HSI16
  #define STM32_PLLCLKIN            (STM32_HSI16CLK / STM32_PLLM_VALUE)

#elif STM32_PLLSRC == RCC_PLLCFGR_PLLSRC_HSE
  #define STM32_PLLCLKIN            (STM32_HSECLK / STM32_PLLM_VALUE)

#else
#error "invalid STM32_PLLSRC value specified"
#endif

/*
 * PLL enable check.
 */
#if (STM32_SW == RCC_CFGR_SW_PLLRCLK) ||                                    \
    (STM32_MCOSEL == RCC_CFGR_MCOSEL_PLLRCLK) ||                            \
    (STM32_MCO2SEL == RCC_CFGR_MCO2SEL_PLLRCLK) ||                          \
    (STM32_TIM1SEL == RCC_CCIPR_TIM1SEL_PLLQCLK) ||                         \
    (STM32_TIM15SEL == RCC_CCIPR_TIM15SEL_PLLQCLK) ||                       \
    (STM32_CLK48SEL == RCC_CCIPR_CLK48SEL_PLLQCLK) ||                       \
    (STM32_ADCSEL == RCC_CCIPR_ADCSEL_PLLPCLK) ||                           \
    defined(__DOXYGEN__)
  /**
   * @brief   PLL activation flag.
   */
  #define STM32_ACTIVATE_PLL        TRUE

#else
  #define STM32_ACTIVATE_PLL        FALSE
#endif

  /**
   * @brief   STM32_PLLREN field.
   */
#if (STM32_SW == STM32_SW_PLLRCLK) ||                                       \
    (STM32_MCOSEL == RCC_CFGR_MCOSEL_PLLRCLK) ||                            \
    (STM32_MCO2SEL == RCC_CFGR_MCO2SEL_PLLRCLK) ||                          \
    defined(__DOXYGEN__)
  #define STM32_PLLREN              RCC_PLLCFGR_PLLREN
#else
  #define STM32_PLLREN              0U
#endif

/**
 * @brief   STM32_PLLQEN field.
 */
#if (STM32_TIM1SEL == RCC_CCIPR_TIM1SEL_PLLQCLK) ||                         \
    (STM32_TIM15SEL == RCC_CCIPR_TIM15SEL_PLLQCLK) ||                       \
    (STM32_CLK48SEL == RCC_CCIPR_CLK48SEL_PLLQCLK) ||                       \
    defined(__DOXYGEN__)
#define STM32_PLLQEN                RCC_PLLCFGR_PLLQEN
#else
#define STM32_PLLQEN                0U
#endif

/**
 * @brief   STM32_PLLPEN field.
 */
#if (STM32_ADCSEL == RCC_CCIPR_ADCSEL_PLLPCLK) ||                           \
    defined(__DOXYGEN__)
#define STM32_PLLPEN                RCC_PLLCFGR_PLLPEN
#else
#define STM32_PLLPEN                0U
#endif

/* Inclusion of PLL-related checks and calculations.*/
#include <stm32_pll_v2.inc>

/**
 * @brief   System clock source.
 */
#if (STM32_SW == RCC_CFGR_SW_MSI)
  #define STM32_SYSCLK              STM32_MSICLK

#if (STM32_SW == RCC_CFGR_SW_HSI16)
  #define STM32_SYSCLK              STM32_HSI16CLK

#elif (STM32_SW == RCC_CFGR_SW_HSE)
  #define STM32_SYSCLK              STM32_HSECLK

#elif (STM32_SW == RCC_CFGR_SW_PLLRCLK)
  #define STM32_SYSCLK              STM32_PLL_R_CLKOUT

#elif (STM32_SW == RCC_CFGR_SW_LSI)
  #define STM32_SYSCLK              STM32_LSICLK

#elif (STM32_SW == RCC_CFGR_SW_LSE)
  #define STM32_SYSCLK              STM32_LSECLK

#else
#error "invalid STM32_SW value specified"
#endif

/* Bus handlers.*/
#include "stm32_ahb.inc"
#include "stm32_apb.inc"

/*
 * Compatibility definitions.
 */
#define STM32_PCLK1                 STM32_PCLK
#define STM32_PCLK2                 STM32_PCLK

/**
 * @brief   MCO divider clock source.
 */
#if (STM32_MCOSEL == RCC_CFGR_MCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_MCODIVCLK           0

#elif STM32_MCOSEL == RCC_CFGR_MCOSEL_SYSCLK
  #define STM32_MCODIVCLK           STM32_SYSCLK

#elif STM32_MCOSEL == RCC_CFGR_MCOSEL_MSI
  #define STM32_MCODIVCLK           STM32_MSICLK

#elif STM32_MCOSEL == RCC_CFGR_MCOSEL_HSI16
  #define STM32_MCODIVCLK           STM32_HSI16CLK

#elif STM32_MCOSEL == RCC_CFGR_MCOSEL_HSE
  #define STM32_MCODIVCLK           STM32_HSECLK

#elif STM32_MCOSEL == RCC_CFGR_MCOSEL_PLLRCLK
  #define STM32_MCODIVCLK           STM32_PLL_R_CLKOUT

#elif STM32_MCOSEL == RCC_CFGR_MCOSEL_LSI
  #define STM32_MCODIVCLK           STM32_LSICLK

#elif STM32_MCOSEL == RCC_CFGR_MCOSEL_LSE
  #define STM32_MCODIVCLK           STM32_LSECLK

#elif STM32_MCOSEL == RCC_CFGR_MCOSEL_HSI48
  #define STM32_MCODIVCLK           STM32_PLLPCLK

#elif STM32_MCOSEL == RCC_CFGR_MCOSEL_RTCCLK
  #define STM32_MCODIVCLK           STM32_RTCCLK

#elif STM32_MCOSEL == RCC_CFGR_MCOSEL_RTCWKP
  #define STM32_MCODIVCLK           0   /* TODO */

#else
  #error "invalid STM32_MCOSEL value specified"
#endif

/**
 * @brief   MCO output pin clock divider.
 */
#if (STM32_MCOPRE == RCC_CFGR_MCOPRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_MCOCLK              STM32_MCODIVCLK

#elif STM32_MCOPRE == RCC_CFGR_MCOPRE_DIV2
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 2)

#elif STM32_MCOPRE == RCC_CFGR_MCOPRE_DIV4
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 4)

