ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U0xx/hal_lld.h
#elif STM32_I2C1SEL == RCC_CCIPR_I2C1SEL_SYSCLK
  #define STM32_I2C1CLK             hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_I2C1SEL == RCC_CCIPR_I2C1SEL_HSI16
  #define STM32_I2C1CLK             STM32_HSI16CLK

#else
  #error "invalid source selected for I2C1 clock"
#endif

/**
 * @brief   I2C3 clock frequency.
 */
#if (STM32_I2C3SEL == RCC_CCIPR_I2C3SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_I2C3CLK             hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_I2C3SEL == RCC_CCIPR_I2C3SEL_SYSCLK
  #define STM32_I2C3CLK             hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_I2C3SEL == RCC_CCIPR_I2C3SEL_HSI16
  #define STM32_I2C3CLK             STM32_HSI16CLK

#else
  #error "invalid source selected for I2C3 clock"
#endif

/**
 * @brief   LPTIM1 clock frequency.
 */
#if (STM32_LPTIM1SEL == RCC_CCIPR_LPTIM1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_LPTIM1CLK           hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_LPTIM1SEL == RCC_CCIPR_LPTIM1SEL_LSI
  #define STM32_LPTIM1CLK           STM32_LSICLK

#elif STM32_LPTIM1SEL == RCC_CCIPR_LPTIM1SEL_HSI16
  #define STM32_LPTIM1CLK           STM32_HSI16CLK

#elif STM32_LPTIM1SEL == RCC_CCIPR_LPTIM1SEL_LSE
  #define STM32_LPTIM1CLK           STM32_LSECLK

#else
#error "invalid source selected for LPTIM1 clock"
#endif

/**
 * @brief   LPTIM2 clock frequency.
 */
#if (STM32_LPTIM2SEL == RCC_CCIPR_LPTIM2SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_LPTIM2CLK           hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_LPTIM2SEL == RCC_CCIPR_LPTIM2SEL_LSI
  #define STM32_LPTIM2CLK           STM32_LSICLK

#elif STM32_LPTIM2SEL == RCC_CCIPR_LPTIM2SEL_HSI16
  #define STM32_LPTIM2CLK           STM32_HSI16CLK

#elif STM32_LPTIM2SEL == RCC_CCIPR_LPTIM2SEL_LSE
  #define STM32_LPTIM2CLK           STM32_LSECLK

#else
#error "invalid source selected for LPTIM2 clock"
#endif

/**
 * @brief   LPTIM3 clock frequency.
 */
#if (STM32_LPTIM3SEL == RCC_CCIPR_LPTIM3SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_LPTIM3CLK           hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_LPTIM3SEL == RCC_CCIPR_LPTIM3SEL_LSI
  #define STM32_LPTIM3CLK           STM32_LSICLK

#elif STM32_LPTIM3SEL == RCC_CCIPR_LPTIM3SEL_HSI16
  #define STM32_LPTIM3CLK           STM32_HSI16CLK

#elif STM32_LPTIM3SEL == RCC_CCIPR_LPTIM3SEL_LSE
  #define STM32_LPTIM3CLK           STM32_LSECLK

#else
#error "invalid source selected for LPTIM3 clock"
#endif

/**
 * @brief   CLK48 clock frequency.
 */
#if (STM32_CLK48SEL == RCC_CCIPR_CLK48SEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_CLK48CLK            0

#elif STM32_CLK48SEL == RCC_CCIPR_CLK48SEL_MSI
  #define STM32_CLK48CLK            STM32_MSICLK

#elif STM32_CLK48SEL == RCC_CCIPR_CLK48SEL_PLLQCLK
  #define STM32_CLK48CLK            hal_lld_get_clock_point(CLK_PLLQCLK)

#elif STM32_CLK48SEL == RCC_CCIPR_CLK48SEL_HSI48
  #define STM32_CLK48CLK            hal_lld_get_clock_point(CLK_HSI48CLK)

#else
#error "invalid source selected for CLK48 clock"
#endif

/**
 * @brief   ADC clock frequency.
 */
#if (STM32_ADCSEL == RCC_CCIPR_ADCSEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_ADCCLK              hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_ADCSEL == RCC_CCIPR_ADCSEL_PLLPCLK
  #define STM32_ADCCLK              hal_lld_get_clock_point(CLK_PLLPCLK)

#elif STM32_ADCSEL == RCC_CCIPR_ADCSEL_HSI16
  #define STM32_ADCCLK              STM32_HSI16CLK

#else
  #error "invalid source selected for ADC clock"
#endif

/**
 * @brief   TIMPCLK clock frequency.
 */
#if (STM32_PPRE == STM32_PPRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_TIMPCLK             (STM32_PCLK * 1)

#else
  #define STM32_TIMPCLK             (STM32_PCLK * 2)
#endif

/**
 * @brief   TIM1 clock frequency.
 */
#if (STM32_TIM1SEL == RCC_CCIPR_TIM1SEL_TIMPCLK) || defined(__DOXYGEN__)
  #define STM32_TIM1CLK             STM32_TIMPCLK

#elif STM32_TIM1SEL == RCC_CCIPR_TIM1SEL_PLLQCLK
  #define STM32_TIM1CLK             hal_lld_get_clock_point(CLK_PLLQCLK)

#else
  #error "invalid source selected for TIM1 clock"
#endif

/**
 * @brief   TIM15 clock frequency.
 */
#if (STM32_TIM15SEL == RCC_CCIPR_TIM15SEL_TIMPCLK) || defined(__DOXYGEN__)
  #define STM32_TIM15CLK            STM32_TIMPCLK

#elif STM32_TIM15SEL == RCC_CCIPR_TIM15SEL_PLLQCLK
  #define STM32_TIM15CLK            hal_lld_get_clock_point(CLK_PLLQCLK)

#else
#error "invalid source selected for TIM15 clock"
#endif

/**
 * @brief   Clock of timers connected to APB1.
 */
#define STM32_TIMCLK1               hal_lld_get_clock_point(CLK_PCLKTIM)

/**
 * @brief   Clock of timers connected to APB2.
 */
#define STM32_TIMCLK2               hal_lld_get_clock_point(CLK_PCLKTIM)

/**
 * @brief   USB clock point.
 */
#define STM32_USBCLK                STM32_CLK48CLK

/**
 * @brief   Flash settings.
 */
#if (STM32_HCLK <= STM32_0WS_THRESHOLD) || defined(__DOXYGEN__)
  #define STM32_FLASHBITS           0

#elif STM32_HCLK <= STM32_1WS_THRESHOLD
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_0

#elif STM32_HCLK <= STM32_2WS_THRESHOLD
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_1

#else
  #define STM32_FLASHBITS           (FLASH_ACR_LATENCY_1 | FLASH_ACR_LATENCY_0)
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
/**
 * @brief   Type of a clock configuration and switch structure.
 */
typedef struct {
  uint32_t          pwr_cr1;
  uint32_t          pwr_cr2;
  uint32_t          rcc_cr;
  uint32_t          rcc_cfgr;
  uint32_t          rcc_pllcfgr;
  uint32_t          flash_acr;
} halclkcfg_t;
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/
#define CLK_SYSCLK                          0U
#define CLK_HSI16CLK                        1U
#define CLK_HSI48CLK                        2U
#define CLK_HSECLK                          3U
#define CLK_LSICLK                          4U
#define CLK_LSECLK                          5U
#define CLK_MSICLK                          6U
#define CLK_PLLPCLK                         7U
#define CLK_PLLQCLK                         8U
#define CLK_PLLRCLK                         9U
#define CLK_HCLK                            10U
#define CLK_PCLK                            11U
#define CLK_PCLKTIM                         12U
#define CLK_MCO                             13U
#define CLK_MCO2                            14U
#define CLK_LSCO                            15U

#if !defined(HAL_LLD_USE_CLOCK_MANAGEMENT)
/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
  #define hal_lld_get_clock_point(clkpt)                                  \
    ((clkpt) == CLK_SYSCLK    ? STM32_SYSCLK        :                     \
     (clkpt) == CLK_HSI16CLK  ? STM32_HSI16CLK      :                     \
     (clkpt) == CLK_HSI48CLK  ? STM32_HSI48CLK      :                     \
     (clkpt) == CLK_HSECLK    ? STM32_HSECLK        :                     \
     (clkpt) == CLK_LSICLK    ? STM32_LSICLK        :                     \
     (clkpt) == CLK_LSECLK    ? STM32_LSECLK        :                     \
     (clkpt) == CLK_MSI       ? STM32_MSICLK        :                     \
     (clkpt) == CLK_PLLPCLK   ? STM32_PLL_P_CLKOUT  :                     \
     (clkpt) == CLK_PLLQCLK   ? STM32_PLL_Q_CLKOUT  :                     \
     (clkpt) == CLK_PLLRCLK   ? STM32_PLL_R_CLKOUT  :                     \
     (clkpt) == CLK_HCLK      ? STM32_HCLK          :                     \
     (clkpt) == CLK_PCLK      ? STM32_PCLK          :                     \
     (clkpt) == CLK_PCLKTIM   ? STM32_TIMPCLK       :                     \
     (clkpt) == CLK_MCO       ? STM32_MCOCLK        :                     \
     (clkpt) == CLK_MCO2      ? STM32_MCO2CLK       :                     \
     (clkpt) == CLK_LSCO      ? STM32_LSCOCLK       :                     \
     0U)
#endif /* !defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/* Various helpers.*/
#include "nvic.h"
#include "cache.h"
#include "stm32_isr.h"
#include "stm32_dma.h"
#include "stm32_exti.h"
#include "stm32_rcc.h"
#include "stm32_tim.h"

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) && !defined(__DOXYGEN__)
extern const halclkcfg_t hal_clkcfg_reset;
extern const halclkcfg_t hal_clkcfg_default;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void stm32_clock_init(void);
#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
  bool hal_lld_clock_switch_mode(const halclkcfg_t *ccp);
  halfreq_t hal_lld_get_clock_point(halclkpt_t clkpt);
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */
#ifdef __cplusplus
}
#endif

#endif /* HAL_LLD_H */

/** @} */
